_import/trunk/Gaja3dService/schema/gaja3d/Gaja3d.wsdl.1.0

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="Gaja3dService" xmlns="http://schemas.xmlsoap.org/wsdl/"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema" targetNamespace="http://org.kalypso.gaja3d.service"
	xmlns:tns="http://org.kalypso.gaja3d.service"
	xmlns:wsrp="http://docs.oasis-open.org/wsrf/2004/06/wsrf-WS-ResourceProperties-1.2-draft-01.xsd"
	xmlns:wsrpw="http://docs.oasis-open.org/wsrf/2004/06/wsrf-WS-ResourceProperties-1.2-draft-01.wsdl"
	xmlns:wsrlw="http://docs.oasis-open.org/wsrf/2004/06/wsrf-WS-ResourceLifetime-1.2-draft-01.wsdl"
	xmlns:wsdlpp="http://www.globus.org/namespaces/2004/10/WSDLPreprocessor"
	xmlns:wsntw="http://docs.oasis-open.org/wsn/2004/06/wsn-WS-BaseNotification-1.2-draft-01.wsdl"
	xmlns:wsbf="http://docs.oasis-open.org/wsrf/2004/06/wsrf-WS-BaseFaults-1.2-draft-01.xsd"
	xmlns:wsbfw="http://docs.oasis-open.org/wsrf/2004/06/wsrf-WS-BaseFaults-1.2-draft-01.wsdl"
	xmlns:wps="http://www.opengis.net/wps/1.0.0" xmlns:ows="http://www.opengis.net/ows/1.1">

	<!--
		====================== I M P O R T S =======================
		============================================================
	-->

	<import
		namespace="http://docs.oasis-open.org/wsn/2004/06/wsn-WS-BaseNotification-1.2-draft-01.wsdl"
		location="../wsrf/notification/WS-BaseN.wsdl" />
	<import
		namespace="http://docs.oasis-open.org/wsrf/2004/06/wsrf-WS-ResourceProperties-1.2-draft-01.wsdl"
		location="../wsrf/properties/WS-ResourceProperties.wsdl" />
	<import
		namespace="http://docs.oasis-open.org/wsrf/2004/06/wsrf-WS-ResourceLifetime-1.2-draft-01.wsdl"
		location="../wsrf/lifetime/WS-ResourceLifetime.wsdl" />
	<import
		namespace="http://docs.oasis-open.org/wsrf/2004/06/wsrf-WS-BaseFaults-1.2-draft-01.wsdl"
		location="../wsrf/faults/WS-BaseFaults.wsdl" />
	<import namespace="http://org.kalypso.gaja3d.service" location="wpsExecute_gaja3d_1.0.xsd" />

	<!--
		======================== T Y P E S ===========================
		==============================================================
	-->
	<types>
		<xsd:schema targetNamespace="http://org.kalypso.gaja3d.service"
			xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"
			xmlns:wsrl="http://docs.oasis-open.org/wsrf/2004/06/wsrf-WS-ResourceLifetime-1.2-draft-01.xsd"
			xmlns:wsbf="http://docs.oasis-open.org/wsrf/2004/06/wsrf-WS-BaseFaults-1.2-draft-01.xsd"
			xmlns:tns="http://org.kalypso.gaja3d.service" xmlns:ows="http://www.opengis.net/ows/1.1"
			xmlns:wps="http://www.opengis.net/wps/1.0.0" xmlns:xlink="http://www.w3.org/1999/xlink"
			xmlns:xsd="http://www.w3.org/2001/XMLSchema">
			<xsd:import namespace="http://schemas.xmlsoap.org/ws/2004/03/addressing"
				location="../ws/addressing/WS-Addressing.xsd" />
			<xsd:include schemaLocation="wpsExecute_gaja3d_1.0.xsd" />

			<xsd:element name="Gaja3dResourceProperties">
				<xsd:complexType>
					<xsd:sequence>
						<xsd:element ref="tns:Boundary" minOccurs="0"
							maxOccurs="unbounded" />
						<xsd:element ref="tns:Breaklines" minOccurs="0"
							maxOccurs="unbounded" />
						<xsd:element ref="tns:DemGrid" minOccurs="0"
							maxOccurs="unbounded" />
						<xsd:element ref="tns:DemPoints" minOccurs="0"
							maxOccurs="1" />
						<xsd:element ref="tns:DistanceTolerance" minOccurs="0"
							maxOccurs="1" />
						<xsd:element ref="tns:EdgeFilter" minOccurs="0"
							maxOccurs="1" />
						<xsd:element ref="tns:FeatureDetector" minOccurs="0"
							maxOccurs="1" />
						<xsd:element ref="tns:GridX" minOccurs="0" maxOccurs="1" />
						<xsd:element ref="tns:GridY" minOccurs="0" maxOccurs="1" />
						<xsd:element ref="tns:MaxArea" minOccurs="0"
							maxOccurs="1" />
						<xsd:element ref="tns:MinAngle" minOccurs="0"
							maxOccurs="1" />
						<xsd:element ref="tns:ModelTin" minOccurs="0"
							maxOccurs="1" />
						<xsd:element ref="tns:SmoothFilter" minOccurs="0"
							maxOccurs="1" />
						<xsd:element name="GramEndpointReference" type="wsa:EndpointReferenceType"
							minOccurs="0" maxOccurs="1" />
					</xsd:sequence>
				</xsd:complexType>
			</xsd:element>
		</xsd:schema>
	</types>

	<!--
		======================= M E S S A G E S ======================
		==============================================================
	-->

	<!-- Generic WPS messages -->
	<message name="GetCapabilitiesRequest">
		<part name="parameters" element="ows:GetCapabilities" />
	</message>
	<message name="GetCapabilitiesResponse">
		<part name="Body" element="wps:Capabilities" />
	</message>
	<message name="DescribeProcessRequest">
		<part name="parameters" element="wps:DescribeProcess" />
	</message>
	<message name="DescribeProcessResponse">
		<part name="Body" element="wps:ProcessDescriptions" />
	</message>
	<message name="ExecuteRequest">
		<part name="parameters" element="wps:Execute" />
	</message>
	<message name="ExecuteResponse">
		<part name="Body" element="wps:ExecuteResponse" />
	</message>

	<!-- Special Gaja3d messages -->
	<message name="Execute_createGridRequest">
		<part name="parameters" element="tns:CreateGridParameters" />
	</message>
	<message name="Execute_createGridResponse">
		<part name="Body" type="tns:CreateGridResponseType" />
	</message>
	<message name="Execute_detectBreaklinesRequest">
		<part name="parameters" element="tns:DetectBreaklinesParameters" />
	</message>
	<message name="Execute_detectBreaklinesResponse">
		<part name="Body" type="tns:DetectBreaklinesResponseType" />
	</message>
	<message name="Execute_createTinRequest">
		<part name="parameters" element="tns:CreateTinParameters" />
	</message>
	<message name="Execute_createTinResponse">
		<part name="Body" type="tns:CreateTinResponseType" />
	</message>

	<!--
		===================== P O R T T Y P E ========================
		==============================================================
	-->

	<portType name="Gaja3dPortType"
		wsdlpp:extends="wsrpw:GetResourceProperty 
                   wsrpw:GetMultipleResourceProperties 
                   wsrpw:SetResourceProperties
                   wsrpw:QueryResourceProperties
                   wsrlw:ImmediateResourceTermination
                   wsrlw:ScheduledResourceTermination
                   wsntw:NotificationProducer"
		wsrp:ResourceProperties="tns:Gaja3dResourceProperties">

		<!-- Generic WPS operations -->
		<operation name="GetCapabilities">
			<documentation>This standard web method is automatically
				generated to give a full description of this operation. The response
				will be an embedded WPS XML GetCapabilities Response. Please consult
				the OGC Web Site for the WPS 1.0.0 specification.</documentation>
			<input name="GetCapabilitiesRequest" message="tns:GetCapabilitiesRequest" />
			<output name="GetCapabilitiesResponse" message="tns:GetCapabilitiesResponse" />
		</operation>
		<operation name="DescribeProcess">
			<documentation>This standard web method is automatically
				generated to give a full description of all processes provided by
				this operation. The response will be an embedded WPS XML
				DescribeProcess Response. Please consult the OGC Web Site for the
				WPS 0.4.0 specification.</documentation>
			<input name="DescribeProcessRequest" message="tns:DescribeProcessRequest" />
			<output name="DescribeProcessResponse" message="tns:DescribeProcessResponse" />
		</operation>
		<operation name="Execute">
			<documentation>This is the generic Execute operation
			</documentation>
			<input name="ExecuteRequest" message="tns:ExecuteRequest" />
			<output name="ExecuteResponse" message="tns:ExecuteResponse" />
		</operation>

		<!-- Specific Gaja3d operations -->
		<operation name="Execute_createGrid">
			<input name="Execute_createGridRequest" message="tns:Execute_createGridRequest" />
			<output name="Execute_createGridResponse" message="tns:Execute_createGridResponse" />
		</operation>
		<operation name="Execute_detectBreaklines">
			<input name="Execute_detectBreaklinesRequest" message="tns:Execute_detectBreaklinesRequest" />
			<output name="Execute_detectBreaklinesResponse" message="tns:Execute_detectBreaklinesResponse" />
		</operation>
		<operation name="Execute_createTin">
			<input name="Execute_createTinRequest" message="tns:Execute_createTinRequest" />
			<output name="Execute_createTinResponse" message="tns:Execute_createTinResponse" />
		</operation>

	</portType>


</definitions>
